In [1]:
import pandas as pd
import numpy as np

In [2]:
marks = pd.DataFrame([(101,'Java',60),(102,'Java',80),(102,'Python',76), (104,'Oracle',88)])

In [3]:
marks

     0       1   2
0  101    Java  60
1  102    Java  80
2  102  Python  76
3  104  Oracle  88

In [4]:
marks = pd.DataFrame([(101,'Java',60),(102,'Java',80),(102,'Python',76), (104,'Oracle',88)],
                    columns=['Rollno','Subject','Marks'])

In [5]:
marks

   Rollno Subject  Marks
0     101    Java     60
1     102    Java     80
2     102  Python     76
3     104  Oracle     88

In [6]:
marks.columns

Index(['Rollno', 'Subject', 'Marks'], dtype='object')

In [7]:
marks.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
sales = pd.read_csv('sales.txt')

In [9]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0